ItaySharon/cmsis-svd/data/Fujitsu/MB9AFAAxN.svd
    </registers>
    <registers>
      <register>
        <access>read-write</access>
        <addressOffset>0x10</addressOffset>
        <description>Base Clock Prescaler Register</description>
        <fields>
          <field>
            <access>read-write</access>
            <bitOffset>0x0</bitOffset>
            <bitWidth>0x3</bitWidth>
            <description>Base clock frequency division ratio setting bit </description>
            <name>BSR</name>
          </field>
        </fields>
        <name>BSC_PSR</name>
        <resetMask>0x7</resetMask>
        <resetValue>0x0</resetValue>
        <size>0x8</size>
      </register>
    </registers>
    <registers>
      <register>
        <access>read-write</access>
        <addressOffset>0x14</addressOffset>
        <description>APB0 Prescaler Register</description>
        <fields>
          <field>
            <access>read-write</access>
            <bitOffset>0x0</bitOffset>
            <bitWidth>0x2</bitWidth>
            <description>APB0 bus clock frequency division ratio setting bit </description>
            <name>APBC0</name>
          </field>
        </fields>
        <name>APBC0_PSR</name>
        <resetMask>0x3</resetMask>
        <resetValue>0x0</resetValue>
        <size>0x8</size>
      </register>
    </registers>
    <registers>
      <register>
        <access>read-write</access>
        <addressOffset>0x18</addressOffset>
        <description>APB1 Prescaler Register</description>
        <fields>
          <field>
            <access>read-write</access>
            <bitOffset>0x7</bitOffset>
            <bitWidth>0x1</bitWidth>
            <description>APB1 clock enable bit</description>
            <name>APBC1EN</name>
          </field>
        </fields>
        <fields>
          <field>
            <access>read-write</access>
            <bitOffset>0x4</bitOffset>
            <bitWidth>0x1</bitWidth>
            <description>APB1 bus reset control bit </description>
            <name>APBC1RST</name>
          </field>
        </fields>
        <fields>
          <field>
            <access>read-write</access>
            <bitOffset>0x0</bitOffset>
            <bitWidth>0x2</bitWidth>
            <description>APB1 bus clock frequency division ratio setting bit </description>
            <name>APBC1</name>
          </field>
        </fields>
        <name>APBC1_PSR</name>
        <resetMask>0x93</resetMask>
        <resetValue>0x80</resetValue>
        <size>0x8</size>
      </register>
    </registers>
    <registers>
      <register>
        <access>read-write</access>
        <addressOffset>0x1C</addressOffset>
        <description>APB2 Prescaler Register</description>
        <fields>
          <field>
            <access>read-write</access>
            <bitOffset>0x7</bitOffset>
            <bitWidth>0x1</bitWidth>
            <description>APB2 clock enable bit </description>
            <name>APBC2EN</name>
          </field>
        </fields>
        <fields>
          <field>
            <access>read-write</access>
            <bitOffset>0x4</bitOffset>
            <bitWidth>0x1</bitWidth>
            <description>APB2 bus reset control bit </description>
            <name>APBC2RST</name>
          </field>
        </fields>
        <fields>
          <field>
            <access>read-write</access>
            <bitOffset>0x0</bitOffset>
            <bitWidth>0x2</bitWidth>
            <description>APB2 bus clock frequency division ratio setting bit </description>
            <name>APBC2</name>
          </field>
        </fields>
        <name>APBC2_PSR</name>
        <resetMask>0x93</resetMask>
        <resetValue>0x80</resetValue>
        <size>0x8</size>
      </register>
    </registers>
    <registers>
      <register>
        <access>read-write</access>
        <addressOffset>0x20</addressOffset>
        <description>Software Watchdog Clock Prescaler Register</description>
        <fields>
          <field>
            <access>read-write</access>
            <bitOffset>0x7</bitOffset>
            <bitWidth>0x1</bitWidth>
            <description>TEST bit </description>
            <name>TESTB</name>
          </field>
        </fields>
        <fields>
          <field>
            <access>read-write</access>
            <bitOffset>0x0</bitOffset>
            <bitWidth>0x2</bitWidth>
            <description>Software watchdog clock frequency division ratio setting bit </description>
            <name>SWDS</name>
          </field>
        </fields>
        <name>SWC_PSR</name>
        <resetMask>0x3</resetMask>
        <resetValue>0x0</resetValue>
        <size>0x8</size>
      </register>
    </registers>
    <registers>
      <register>
        <access>read-write</access>
        <addressOffset>0x28</addressOffset>
        <description>Trace Clock Prescaler Register</description>
        <fields>
          <field>
            <access>read-write</access>
            <bitOffset>0x0</bitOffset>
            <bitWidth>0x2</bitWidth>
            <description>Trace clock frequency division ratio setting bit</description>
            <name>TTC</name>
          </field>
        </fields>
        <name>TTC_PSR</name>
        <resetMask>0x3</resetMask>
        <resetValue>0x0</resetValue>
        <size>0x8</size>
      </register>
    </registers>
    <registers>
      <register>
        <access>read-write</access>
        <addressOffset>0x30</addressOffset>
        <description>Clock Stabilization Wait Time Register</description>
        <fields>
          <field>
            <access>read-write</access>
            <bitOffset>0x4</bitOffset>
            <bitWidth>0x3</bitWidth>
            <description>Sub clock stabilization wait time setup bit </description>
            <name>SOWT</name>
          </field>
        </fields>
        <fields>
          <field>
            <access>read-write</access>
            <bitOffset>0x0</bitOffset>
            <bitWidth>0x4</bitWidth>
            <description>Main clock stabilization wait time setup bit </description>
            <name>MOWT</name>
          </field>
        </fields>
        <name>CSW_TMR</name>
        <resetMask>0x7F</resetMask>
        <resetValue>0x0</resetValue>
        <size>0x8</size>
      </register>
