ItaySharon/cmsis-svd/data/Fujitsu/MB9AFAAxN.svd
    </registers>
    <registers>
      <register>
        <access>read-write</access>
        <addressOffset>0x60</addressOffset>
        <description>"ICU ch.1,0 Connecting FRT Select Register"</description>
        <fields>
          <field>
            <access>read-write</access>
            <bitOffset>0x0</bitOffset>
            <bitWidth>0x4</bitWidth>
            <description>Connects FRT ch.x to ICU ch.(0)</description>
            <name>FSI0</name>
          </field>
        </fields>
        <fields>
          <field>
            <access>read-write</access>
            <bitOffset>0x4</bitOffset>
            <bitWidth>0x4</bitWidth>
            <description>Connects FRT ch.x to ICU ch.(1)</description>
            <name>FSI1</name>
          </field>
        </fields>
        <name>ICU_ICFS10</name>
        <resetMask>0xFF</resetMask>
        <resetValue>0x0</resetValue>
        <size>0x8</size>
      </register>
    </registers>
    <registers>
      <register>
        <access>read-write</access>
        <addressOffset>0x61</addressOffset>
        <description>"ICU ch.3,2 Connecting FRT Select Register"</description>
        <fields></fields>
        <name>ICU_ICFS32</name>
        <resetMask>0x0</resetMask>
        <resetValue>0x0</resetValue>
        <size>0x20</size>
      </register>
    </registers>
    <registers>
      <register>
        <access>read-write</access>
        <addressOffset>0x78</addressOffset>
        <description>"ICU ch.1,0 Control Register A"</description>
        <fields>
          <field>
            <access>read-write</access>
            <bitOffset>0x0</bitOffset>
            <bitWidth>0x2</bitWidth>
            <description>enables/disables the operation of ICU-ch.(0) and selects a valid edge(s)</description>
            <name>EG0</name>
          </field>
        </fields>
        <fields>
          <field>
            <access>read-write</access>
            <bitOffset>0x2</bitOffset>
            <bitWidth>0x2</bitWidth>
            <description>enables/disables the operation of ICU-ch.(1) and selects a valid edge(s)</description>
            <name>EG1</name>
          </field>
        </fields>
        <fields>
          <field>
            <access>read-write</access>
            <bitOffset>0x4</bitOffset>
            <bitWidth>0x1</bitWidth>
            <description>"Generates interrupt, when ""1"" is set to ICSA.ICP0."</description>
            <name>ICE0</name>
          </field>
        </fields>
        <fields>
          <field>
            <access>read-write</access>
            <bitOffset>0x5</bitOffset>
            <bitWidth>0x1</bitWidth>
            <description>"Generates interrupt, when ""1"" is set to ICSA.ICP1."</description>
            <name>ICE1</name>
          </field>
        </fields>
        <fields>
          <field>
            <access>read-write</access>
            <bitOffset>0x6</bitOffset>
            <bitWidth>0x1</bitWidth>
            <description>Indicates that a valid edge has been detected at ICU ch.(0) and the capture operation has been performed</description>
            <name>ICP0</name>
          </field>
        </fields>
        <fields>
          <field>
            <access>read-write</access>
            <bitOffset>0x7</bitOffset>
            <bitWidth>0x1</bitWidth>
            <description>Indicates that a valid edge has been detected at ICU ch.(1) and the capture operation has been performed</description>
            <name>ICP1</name>
          </field>
        </fields>
        <name>ICU_ICSA10</name>
        <resetMask>0xFF</resetMask>
        <resetValue>0x0</resetValue>
        <size>0x8</size>
      </register>
    </registers>
    <registers>
      <register>
        <access>read-write</access>
        <addressOffset>0x7C</addressOffset>
        <description>"ICU ch.3,2 Control Register A"</description>
        <fields></fields>
        <name>ICU_ICSA32</name>
        <resetMask>0x0</resetMask>
        <resetValue>0x0</resetValue>
        <size>0x20</size>
      </register>
    </registers>
    <registers>
      <register>
        <access>read-only</access>
        <addressOffset>0x79</addressOffset>
        <description>"ICU ch.1,0 Control Register B"</description>
        <fields>
          <field>
            <access>read-only</access>
            <bitOffset>0x0</bitOffset>
            <bitWidth>0x1</bitWidth>
            <description>indicates the latest valid edge of ICU-ch.(0)</description>
            <name>IEI0</name>
          </field>
        </fields>
        <fields>
          <field>
            <access>read-only</access>
            <bitOffset>0x1</bitOffset>
            <bitWidth>0x1</bitWidth>
            <description>indicates the latest valid edge of ICU-ch.(1)</description>
            <name>IEI1</name>
          </field>
        </fields>
        <name>ICU_ICSB10</name>
        <resetMask>0x3</resetMask>
        <resetValue>0x0</resetValue>
        <size>0x8</size>
      </register>
    </registers>
    <registers>
      <register>
        <access>read-write</access>
        <addressOffset>0x7D</addressOffset>
        <description>"ICU ch.3,2 Control Register B"</description>
        <fields></fields>
        <name>ICU_ICSB32</name>
        <resetMask>0x0</resetMask>
        <resetValue>0x0</resetValue>
        <size>0x20</size>
      </register>
    </registers>
    <registers>
      <register>
        <access>read-only</access>
        <addressOffset>0x68</addressOffset>
        <description>ICU ch.0 Capture value store register</description>
        <fields></fields>
        <name>ICU_ICCP0</name>
        <resetMask>0x0</resetMask>
        <resetValue>0x0</resetValue>
        <size>0x10</size>
      </register>
    </registers>
    <registers>
      <register>
        <access>read-write</access>
        <addressOffset>0x6C</addressOffset>
        <description>ICU ch.1 Capture value store register</description>
        <fields></fields>
        <name>ICU_ICCP1</name>
        <resetMask>0x0</resetMask>
        <resetValue>0x0</resetValue>
        <size>0x20</size>
      </register>
