ItaySharon/cmsis-svd/data/Fujitsu/MB9AFAAxN.svd
    </registers>
    <registers>
      <register>
        <access>read-write</access>
        <addressOffset>0xB0</addressOffset>
        <description>ADCMP ch.2 Compare Value Store Register</description>
        <fields></fields>
        <name>ADCMP_ACCP2</name>
        <resetMask>0x0</resetMask>
        <resetValue>0x0</resetValue>
        <size>0x20</size>
      </register>
    </registers>
    <registers>
      <register>
        <access>read-write</access>
        <addressOffset>0xA4</addressOffset>
        <description>ADCMP ch.0 Compare Value Store Register</description>
        <fields></fields>
        <name>ADCMP_ACCPDN0</name>
        <resetMask>0xFFFF</resetMask>
        <resetValue>0x0</resetValue>
        <size>0x10</size>
      </register>
    </registers>
    <registers>
      <register>
        <access>read-write</access>
        <addressOffset>0xAC</addressOffset>
        <description>ADCMP ch.1 Compare Value Store Register</description>
        <fields></fields>
        <name>ADCMP_ACCPDN1</name>
        <resetMask>0x0</resetMask>
        <resetValue>0x0</resetValue>
        <size>0x20</size>
      </register>
    </registers>
    <registers>
      <register>
        <access>read-write</access>
        <addressOffset>0xB4</addressOffset>
        <description>ADCMP ch.2 Compare Value Store Register</description>
        <fields></fields>
        <name>ADCMP_ACCPDN2</name>
        <resetMask>0x0</resetMask>
        <resetValue>0x0</resetValue>
        <size>0x20</size>
      </register>
    </registers>
    <registers>
      <register>
        <access>read-write</access>
        <addressOffset>0xC0</addressOffset>
        <description>ADC Start Trigger Select Register</description>
        <fields>
          <field>
            <access>read-write</access>
            <bitOffset>0x0</bitOffset>
            <bitWidth>0x2</bitWidth>
            <description>selects the start signal to be used to start the scan conversion of ADC unit0</description>
            <name>AD0S</name>
          </field>
        </fields>
        <fields>
          <field>
            <access>read-write</access>
            <bitOffset>0x2</bitOffset>
            <bitWidth>0x2</bitWidth>
            <description>selects the start signal to be used to start the scan conversion of ADC unit1</description>
            <name>AD1S</name>
          </field>
        </fields>
        <fields>
          <field>
            <access>read-write</access>
            <bitOffset>0x4</bitOffset>
            <bitWidth>0x2</bitWidth>
            <description>selects the start signal to be used to start the scan conversion of ADC unit2</description>
            <name>AD2S</name>
          </field>
        </fields>
        <fields>
          <field>
            <access>read-write</access>
            <bitOffset>0x8</bitOffset>
            <bitWidth>0x2</bitWidth>
            <description>selects the start signal to be used to start priority conversion of ADC unit0</description>
            <name>AD0P</name>
          </field>
        </fields>
        <fields>
          <field>
            <access>read-write</access>
            <bitOffset>0xA</bitOffset>
            <bitWidth>0x2</bitWidth>
            <description>selects the start signal to be used to start priority conversion of ADC unit1</description>
            <name>AD1P</name>
          </field>
        </fields>
        <fields>
          <field>
            <access>read-write</access>
            <bitOffset>0xC</bitOffset>
            <bitWidth>0x2</bitWidth>
            <description>selects the start signal to be used to start priority conversion of ADC unit2</description>
            <name>AD2P</name>
          </field>
        </fields>
        <name>ADCMP_ATSA</name>
        <resetMask>0x3F3F</resetMask>
        <resetValue>0x0</resetValue>
        <size>0x10</size>
      </register>
    </registers>
    <resetMask>0x0</resetMask>
    <resetValue>0x0</resetValue>
    <size>0x20</size>
  </peripheral>
</peripherals>
<peripherals>
  <peripheral>
    <access>read-write</access>
    <addressBlock>
      <offset>0x0</offset>
      <size>0x2</size>
      <usage>registers</usage>
    </addressBlock>
    <baseAddress>0x40025100</baseAddress>
    <description> Base Timer I/O Select</description>
    <groupName>BTIOSEL03</groupName>
    <interrupts></interrupts>
    <name>BTIOSEL03</name>
    <registers>
      <register>
        <access>read-write</access>
        <addressOffset>0x0</addressOffset>
        <description>I/O Select Register</description>
        <fields>
          <field>
            <access>read-write</access>
            <bitOffset>0xC</bitOffset>
            <bitWidth>0x4</bitWidth>
            <description>I/O select bits for Ch.2/Ch.3 </description>
            <name>SEL23_</name>
          </field>
        </fields>
        <fields>
          <field>
            <access>read-write</access>
            <bitOffset>0x8</bitOffset>
            <bitWidth>0x4</bitWidth>
            <description>I/O select bits for Ch.0/Ch.1 </description>
            <name>SEL01_</name>
          </field>
        </fields>
        <name>BTSEL0123</name>
        <resetMask>0xFF00</resetMask>
        <resetValue>0x0</resetValue>
        <size>0x10</size>
      </register>
    </registers>
    <resetMask>0x0</resetMask>
    <resetValue>0x0</resetValue>
    <size>0x20</size>
  </peripheral>
</peripherals>
<peripherals>
  <peripheral>
    <access>read-write</access>
    <addressBlock>
      <offset>0x0</offset>
      <size>0x2</size>
      <usage>registers</usage>
    </addressBlock>
    <baseAddress>0x40025300</baseAddress>
    <description> Base Timer I/O Select</description>
    <groupName>BTIOSEL47</groupName>
    <interrupts></interrupts>
    <name>BTIOSEL47</name>
    <registers>
      <register>
        <access>read-write</access>
        <addressOffset>0x0</addressOffset>
        <description>I/O Select Register</description>
        <fields>
          <field>
            <access>read-write</access>
            <bitOffset>0xC</bitOffset>
            <bitWidth>0x4</bitWidth>
            <description>I/O select bits for Ch.6/Ch.7 </description>
            <name>SEL67_</name>
          </field>
        </fields>
        <fields>
          <field>
            <access>read-write</access>
            <bitOffset>0x8</bitOffset>
            <bitWidth>0x4</bitWidth>
            <description>I/O select bits for Ch.4/Ch.5</description>
            <name>SEL45_</name>
          </field>
        </fields>
        <name>BTSEL4567</name>
        <resetMask>0xFF00</resetMask>
        <resetValue>0x0</resetValue>
        <size>0x10</size>
      </register>
