ItaySharon/cmsis-svd/data/Fujitsu/MB9AFAAxN.svd
    </registers>
    <registers>
      <register>
        <access>read-write</access>
        <addressOffset>0x11</addressOffset>
        <alternateGroup>PWM</alternateGroup>
        <description>Timer Control Register 2</description>
        <fields>
          <field>
            <access>read-write</access>
            <bitOffset>0x0</bitOffset>
            <bitWidth>0x1</bitWidth>
            <description>Count clock selection bit</description>
            <name>CKS3</name>
          </field>
        </fields>
        <name>PWM_TMCR2</name>
        <resetMask>0x1</resetMask>
        <resetValue>0x0</resetValue>
        <size>0x8</size>
      </register>
    </registers>
    <registers>
      <register>
        <access>read-write</access>
        <addressOffset>0x10</addressOffset>
        <alternateGroup>PWM</alternateGroup>
        <description> Status Control Register</description>
        <fields>
          <field>
            <access>read-write</access>
            <bitOffset>0x6</bitOffset>
            <bitWidth>0x1</bitWidth>
            <description>Trigger interrupt request enable bit</description>
            <name>TGIE</name>
          </field>
        </fields>
        <fields>
          <field>
            <access>read-write</access>
            <bitOffset>0x5</bitOffset>
            <bitWidth>0x1</bitWidth>
            <description>Duty match interrupt request enable bit </description>
            <name>DTIE</name>
          </field>
        </fields>
        <fields>
          <field>
            <access>read-write</access>
            <bitOffset>0x4</bitOffset>
            <bitWidth>0x1</bitWidth>
            <description>Underflow interrupt request enable bit </description>
            <name>UDIE</name>
          </field>
        </fields>
        <fields>
          <field>
            <access>read-write</access>
            <bitOffset>0x2</bitOffset>
            <bitWidth>0x1</bitWidth>
            <description>Trigger interrupt request bit </description>
            <name>TGIR</name>
          </field>
        </fields>
        <fields>
          <field>
            <access>read-write</access>
            <bitOffset>0x1</bitOffset>
            <bitWidth>0x1</bitWidth>
            <description>Duty match interrupt request bit </description>
            <name>DTIR</name>
          </field>
        </fields>
        <fields>
          <field>
            <access>read-write</access>
            <bitOffset>0x0</bitOffset>
            <bitWidth>0x1</bitWidth>
            <description>Underflow interrupt request bit </description>
            <name>UDIR</name>
          </field>
        </fields>
        <name>PWM_STC</name>
        <resetMask>0x77</resetMask>
        <resetValue>0x0</resetValue>
        <size>0x8</size>
      </register>
    </registers>
    <registers>
      <register>
        <access>read-write</access>
        <addressOffset>0x0</addressOffset>
        <alternateGroup>PWM</alternateGroup>
        <description>PWM Cycle Set Register</description>
        <fields></fields>
        <name>PWM_PCSR</name>
        <resetMask>0x0</resetMask>
        <resetValue>0x0</resetValue>
        <size>0x10</size>
      </register>
    </registers>
    <registers>
      <register>
        <access>read-write</access>
        <addressOffset>0x4</addressOffset>
        <alternateGroup>PWM</alternateGroup>
        <description>PWM Duty Set Register</description>
        <fields></fields>
        <name>PWM_PDUT</name>
        <resetMask>0x0</resetMask>
        <resetValue>0x0</resetValue>
        <size>0x10</size>
      </register>
    </registers>
    <registers>
      <register>
        <access>read-only</access>
        <addressOffset>0x8</addressOffset>
        <alternateGroup>PWM</alternateGroup>
        <description>Timer Register</description>
        <fields></fields>
        <name>PWM_TMR</name>
        <resetMask>0xFFFF</resetMask>
        <resetValue>0x0</resetValue>
        <size>0x10</size>
      </register>
    </registers>
    <registers>
      <register>
        <access>read-write</access>
        <addressOffset>0xC</addressOffset>
        <alternateGroup>PPG</alternateGroup>
        <description>Timer Control Register</description>
        <fields>
          <field>
            <access>read-write</access>
            <bitOffset>0xC</bitOffset>
            <bitWidth>0x3</bitWidth>
            <description>Count clock selection bit </description>
            <name>CKS2_0</name>
          </field>
        </fields>
        <fields>
          <field>
            <access>read-write</access>
            <bitOffset>0xB</bitOffset>
            <bitWidth>0x1</bitWidth>
            <description>Restart enable bit</description>
            <name>RTGEN</name>
          </field>
        </fields>
        <fields>
          <field>
            <access>read-write</access>
            <bitOffset>0xA</bitOffset>
            <bitWidth>0x1</bitWidth>
            <description> Pulse output mask bit </description>
            <name>PMSK</name>
          </field>
        </fields>
        <fields>
          <field>
            <access>read-write</access>
            <bitOffset>0x8</bitOffset>
            <bitWidth>0x2</bitWidth>
            <description>Trigger input edge selection bits</description>
            <name>EGS</name>
          </field>
        </fields>
        <fields>
          <field>
            <access>read-write</access>
            <bitOffset>0x4</bitOffset>
            <bitWidth>0x3</bitWidth>
            <description>Timer function selection bits</description>
            <name>FMD</name>
          </field>
        </fields>
        <fields>
          <field>
            <access>read-write</access>
            <bitOffset>0x3</bitOffset>
            <bitWidth>0x1</bitWidth>
            <description>Output polarity specification bit</description>
            <name>OSEL</name>
          </field>
        </fields>
        <fields>
          <field>
            <access>read-write</access>
            <bitOffset>0x2</bitOffset>
            <bitWidth>0x1</bitWidth>
            <description>Mode selection bit </description>
            <name>MDSE</name>
          </field>
        </fields>
        <fields>
          <field>
            <access>read-write</access>
            <bitOffset>0x1</bitOffset>
            <bitWidth>0x1</bitWidth>
            <description>Count operation enable bit </description>
            <name>CTEN</name>
          </field>
        </fields>
        <fields>
          <field>
            <access>read-write</access>
            <bitOffset>0x0</bitOffset>
            <bitWidth>0x1</bitWidth>
            <description>Software trigger bit </description>
            <name>STRG</name>
          </field>
        </fields>
        <name>PPG_TMCR</name>
        <resetMask>0x7F7F</resetMask>
        <resetValue>0x0</resetValue>
        <size>0x10</size>
      </register>
