ItaySharon/cmsis-svd/data/Fujitsu/MB9AFAAxN.svd
    </registers>
    <registers>
      <register>
        <access>read-only</access>
        <addressOffset>0x70</addressOffset>
        <description>IRQ23 Batch Read Register</description>
        <fields>
          <field>
            <access>read-only</access>
            <bitOffset>0x5</bitOffset>
            <bitWidth>0x1</bitWidth>
            <description>RTC interrupt request </description>
            <name>RTCINT</name>
          </field>
        </fields>
        <fields>
          <field>
            <access>read-only</access>
            <bitOffset>0x2</bitOffset>
            <bitWidth>0x1</bitWidth>
            <description>Stabilization wait completion interrupt request for main PLL oscillation </description>
            <name>MPLLINT</name>
          </field>
        </fields>
        <fields>
          <field>
            <access>read-only</access>
            <bitOffset>0x1</bitOffset>
            <bitWidth>0x1</bitWidth>
            <description>Stabilization wait completion interrupt request for sub-clock oscillation</description>
            <name>SOSCINT</name>
          </field>
        </fields>
        <fields>
          <field>
            <access>read-only</access>
            <bitOffset>0x0</bitOffset>
            <bitWidth>0x1</bitWidth>
            <description>Stabilization wait completion interrupt request for main clock oscillation </description>
            <name>MOSCINT</name>
          </field>
        </fields>
        <name>IRQ23MON</name>
        <resetMask>0x27</resetMask>
        <resetValue>0x0</resetValue>
        <size>0x20</size>
      </register>
    </registers>
    <registers>
      <register>
        <access>read-only</access>
        <addressOffset>0x74</addressOffset>
        <description>IRQ24 Batch Read Register</description>
        <fields>
          <field>
            <access>read-only</access>
            <bitOffset>0x3</bitOffset>
            <bitWidth>0x1</bitWidth>
            <description>Conversion result comparison interrupt request in the corresponding A/D unit 0. </description>
            <name>ADCINT3</name>
          </field>
        </fields>
        <fields>
          <field>
            <access>read-only</access>
            <bitOffset>0x2</bitOffset>
            <bitWidth>0x1</bitWidth>
            <description>FIFO overrun interrupt request in the corresponding A/D unit 0. </description>
            <name>ADCINT2</name>
          </field>
        </fields>
        <fields>
          <field>
            <access>read-only</access>
            <bitOffset>0x1</bitOffset>
            <bitWidth>0x1</bitWidth>
            <description>Scan conversion interrupt request in the corresponding A/D unit 0. </description>
            <name>ADCINT1</name>
          </field>
        </fields>
        <fields>
          <field>
            <access>read-only</access>
            <bitOffset>0x0</bitOffset>
            <bitWidth>0x1</bitWidth>
            <description>Priority conversion interrupt request in the corresponding A/D unit 0.</description>
            <name>ADCINT0</name>
          </field>
        </fields>
        <name>IRQ24MON</name>
        <resetMask>0xF</resetMask>
        <resetValue>0x0</resetValue>
        <size>0x20</size>
      </register>
    </registers>
    <registers>
      <register>
        <access>read-only</access>
        <addressOffset>0x78</addressOffset>
        <description>IRQ25 Batch Read Register</description>
        <fields>
          <field>
            <access>read-only</access>
            <bitOffset>0x5</bitOffset>
            <bitWidth>0x1</bitWidth>
            <description>Zero detection interrupt request on the free run timer ch.2 in the MFT unit 0</description>
            <name>FRT0INT5</name>
          </field>
        </fields>
        <fields>
          <field>
            <access>read-only</access>
            <bitOffset>0x4</bitOffset>
            <bitWidth>0x1</bitWidth>
            <description>Zero detection interrupt request on the free run timer ch.1 in the MFT unit 0</description>
            <name>FRT0INT4</name>
          </field>
        </fields>
        <fields>
          <field>
            <access>read-only</access>
            <bitOffset>0x3</bitOffset>
            <bitWidth>0x1</bitWidth>
            <description>Zero detection interrupt request on the free run timer ch.0 in the MFT unit 0</description>
            <name>FRT0INT3</name>
          </field>
        </fields>
        <fields>
          <field>
            <access>read-only</access>
            <bitOffset>0x2</bitOffset>
            <bitWidth>0x1</bitWidth>
            <description>Peak value detection interrupt request on the free run timer ch.2 in the MFT unit 0</description>
            <name>FRT0INT2</name>
          </field>
        </fields>
        <fields>
          <field>
            <access>read-only</access>
            <bitOffset>0x1</bitOffset>
            <bitWidth>0x1</bitWidth>
            <description>Peak value detection interrupt request on the free run timer ch.1 in the MFT unit 0</description>
            <name>FRT0INT1</name>
          </field>
        </fields>
        <fields>
          <field>
            <access>read-only</access>
            <bitOffset>0x0</bitOffset>
            <bitWidth>0x1</bitWidth>
            <description>Peak value detection interrupt request on the free run timer ch.0 in the MFT unit 0</description>
            <name>FRT0INT0</name>
          </field>
        </fields>
        <name>IRQ25MON</name>
        <resetMask>0x3F</resetMask>
        <resetValue>0x0</resetValue>
        <size>0x20</size>
      </register>
    </registers>
    <registers>
      <register>
        <access>read-only</access>
        <addressOffset>0x7C</addressOffset>
        <description>IRQ26 Batch Read Register</description>
        <fields>
          <field>
            <access>read-only</access>
            <bitOffset>0x3</bitOffset>
            <bitWidth>0x1</bitWidth>
            <description>Interrupt request on the input capture ch.3 in the MFT unit 0</description>
            <name>ICU0INT3</name>
          </field>
        </fields>
        <fields>
          <field>
            <access>read-only</access>
            <bitOffset>0x2</bitOffset>
            <bitWidth>0x1</bitWidth>
            <description>Interrupt request on the input capture ch.2 in the MFT unit 0</description>
            <name>ICU0INT2</name>
          </field>
        </fields>
        <fields>
          <field>
            <access>read-only</access>
            <bitOffset>0x1</bitOffset>
            <bitWidth>0x1</bitWidth>
            <description>Interrupt request on the input capture ch.1 in the MFT unit 0</description>
            <name>ICU0INT1</name>
          </field>
        </fields>
        <fields>
          <field>
            <access>read-only</access>
            <bitOffset>0x0</bitOffset>
            <bitWidth>0x1</bitWidth>
            <description>Interrupt request on the input capture ch.0 in the MFT unit 0</description>
            <name>ICU0INT0</name>
          </field>
        </fields>
        <name>IRQ26MON</name>
        <resetMask>0xF</resetMask>
        <resetValue>0x0</resetValue>
        <size>0x20</size>
      </register>
