ItaySharon/cmsis-svd/data/Fujitsu/MB9AFAAxN.svd
    </registers>
    <registers>
      <register>
        <access>read-write</access>
        <addressOffset>0x88</addressOffset>
        <description>IRQ29 Batch Read Register</description>
        <fields>
          <field>
            <access>read-only</access>
            <bitOffset>0x4</bitOffset>
            <bitWidth>0x1</bitWidth>
            <description>LCDC interrupt request for LCD controller </description>
            <name>LCDCINT</name>
          </field>
        </fields>
        <name>IRQ29MON</name>
        <resetMask>0x10</resetMask>
        <resetValue>0x0</resetValue>
        <size>0x20</size>
      </register>
    </registers>
    <registers>
      <register>
        <access>read-write</access>
        <addressOffset>0x8C</addressOffset>
        <description>IRQ30 Batch Read Register</description>
        <fields>
          <field>
            <access>read-only</access>
            <bitOffset>0x5</bitOffset>
            <bitWidth>0x1</bitWidth>
            <description>Interrupt request for HDMI-CEC/Remote Control Reception ch.0</description>
            <name>RCEC0INT</name>
          </field>
        </fields>
        <name>IRQ30MON</name>
        <resetMask>0x20</resetMask>
        <resetValue>0x0</resetValue>
        <size>0x20</size>
      </register>
    </registers>
    <registers>
      <register>
        <access>read-write</access>
        <addressOffset>0x90</addressOffset>
        <description>IRQ31 Batch Read Register</description>
        <fields>
          <field>
            <access>read-only</access>
            <bitOffset>0x6</bitOffset>
            <bitWidth>0x1</bitWidth>
            <description>Interrupt request for HDMI-CEC/Remote Control Reception ch.1</description>
            <name>RCEC1INT</name>
          </field>
        </fields>
        <name>IRQ31MON</name>
        <resetMask>0x40</resetMask>
        <resetValue>0x0</resetValue>
        <size>0x20</size>
      </register>
    </registers>
    <resetMask>0x0</resetMask>
    <resetValue>0x0</resetValue>
    <size>0x20</size>
  </peripheral>
</peripherals>
<peripherals>
  <peripheral>
    <access>read-write</access>
    <addressBlock>
      <offset>0x0</offset>
      <size>0x3</size>
      <usage>registers</usage>
    </addressBlock>
    <baseAddress>0x40032000</baseAddress>
    <description>LCD Controller</description>
    <groupName>LCDC</groupName>
    <interrupts>
      <interrupt>
        <name>LCDC</name>
        <value>0x1D</value>
      </interrupt>
    </interrupts>
    <name>LCDC</name>
    <registers>
      <register>
        <access>read-write</access>
        <addressOffset>0x0</addressOffset>
        <description>LCDC Control Register 1</description>
        <fields>
          <field>
            <access>read-write</access>
            <bitOffset>0x6</bitOffset>
            <bitWidth>0x1</bitWidth>
            <description>Timer mode operation enable bit </description>
            <name>LCDEN</name>
          </field>
        </fields>
        <fields>
          <field>
            <access>read-write</access>
            <bitOffset>0x5</bitOffset>
            <bitWidth>0x1</bitWidth>
            <description>LCD drive power control bit </description>
            <name>VSEL</name>
          </field>
        </fields>
        <fields>
          <field>
            <access>read-write</access>
            <bitOffset>0x2</bitOffset>
            <bitWidth>0x3</bitWidth>
            <description>LCD controller display mode selection bits</description>
            <name>MS</name>
          </field>
        </fields>
        <name>LCDCC1</name>
        <resetMask>0x7C</resetMask>
        <resetValue>0x0</resetValue>
        <size>0x8</size>
      </register>
    </registers>
    <registers>
      <register>
        <access>read-write</access>
        <addressOffset>0x1</addressOffset>
        <description>LCDC Control Register 2</description>
        <fields>
          <field>
            <access>read-write</access>
            <bitOffset>0x5</bitOffset>
            <bitWidth>0x1</bitWidth>
            <description>Divider resistor value selection bit</description>
            <name>RSEL</name>
          </field>
        </fields>
        <fields>
          <field>
            <access>read-write</access>
            <bitOffset>0x4</bitOffset>
            <bitWidth>0x1</bitWidth>
            <description>8 COM mode bias selection bit </description>
            <name>BLS8</name>
          </field>
        </fields>
        <fields>
          <field>
            <access>read-write</access>
            <bitOffset>0x3</bitOffset>
            <bitWidth>0x1</bitWidth>
            <description>Reverse display control bit </description>
            <name>INV</name>
          </field>
        </fields>
        <fields>
          <field>
            <access>read-write</access>
            <bitOffset>0x2</bitOffset>
            <bitWidth>0x1</bitWidth>
            <description>Blank display control bit </description>
            <name>BK</name>
          </field>
        </fields>
        <fields>
          <field>
            <access>read-write</access>
            <bitOffset>0x1</bitOffset>
            <bitWidth>0x1</bitWidth>
            <description>Interrupt enable bit </description>
            <name>LCDIEN</name>
          </field>
        </fields>
        <fields>
          <field>
            <access>read-write</access>
            <bitOffset>0x0</bitOffset>
            <bitWidth>0x1</bitWidth>
            <description>Interrupt request detection bit </description>
            <name>LCDIF</name>
          </field>
        </fields>
        <name>LCDCC2</name>
        <resetMask>0x3F</resetMask>
        <resetValue>0x14</resetValue>
        <size>0x8</size>
      </register>
    </registers>
    <registers>
      <register>
        <access>read-write</access>
        <addressOffset>0x2</addressOffset>
        <description>LCDC Control Register 3</description>
        <fields>
          <field>
            <access>read-write</access>
            <bitOffset>0x7</bitOffset>
            <bitWidth>0x1</bitWidth>
            <description>I/O port input control bit </description>
            <name>PICTL</name>
          </field>
        </fields>
        <fields>
          <field>
            <access>read-write</access>
            <bitOffset>0x6</bitOffset>
            <bitWidth>0x1</bitWidth>
            <description>Blink interval selection bit</description>
            <name>BLSEL</name>
          </field>
        </fields>
        <fields>
          <field>
            <access>read-write</access>
            <bitOffset>0x5</bitOffset>
            <bitWidth>0x1</bitWidth>
            <description>VV4 selection bit </description>
            <name>VE4</name>
          </field>
        </fields>
        <fields>
          <field>
            <access>read-write</access>
            <bitOffset>0x4</bitOffset>
            <bitWidth>0x1</bitWidth>
            <description>VV3 selection bit </description>
            <name>VE3</name>
          </field>
        </fields>
        <fields>
          <field>
            <access>read-write</access>
            <bitOffset>0x3</bitOffset>
            <bitWidth>0x1</bitWidth>
            <description>VV2 selection bit </description>
            <name>VE2</name>
          </field>
        </fields>
        <fields>
          <field>
            <access>read-write</access>
            <bitOffset>0x2</bitOffset>
            <bitWidth>0x1</bitWidth>
            <description>VV1 selection bit </description>
            <name>VE1</name>
          </field>
        </fields>
        <fields>
          <field>
            <access>read-write</access>
            <bitOffset>0x1</bitOffset>
            <bitWidth>0x1</bitWidth>
            <description>VV0 selection bit </description>
            <name>VE0</name>
          </field>
        </fields>
        <name>LCDCC3</name>
        <resetMask>0xFE</resetMask>
        <resetValue>0x3E</resetValue>
        <size>0x8</size>
      </register>
