ItaySharon/cmsis-svd/data/Fujitsu/MB9AFAAxN.svd
    </registers>
    <registers>
      <register>
        <access>read-write</access>
        <addressOffset>0x44</addressOffset>
        <description>"H" Width Setting Register A</description>
        <fields>
          <field>
            <access>read-write</access>
            <bitOffset>0x0</bitOffset>
            <bitWidth>0x8</bitWidth>
            <description>"H" Width Setting A</description>
            <name>RCDAHW</name>
          </field>
        </fields>
        <name>RCDAHW</name>
        <resetMask>0xFF</resetMask>
        <resetValue>0x0</resetValue>
        <size>0x8</size>
      </register>
    </registers>
    <registers>
      <register>
        <access>read-write</access>
        <addressOffset>0x45</addressOffset>
        <description>Start Bit "H" Width Setting Register</description>
        <fields>
          <field>
            <access>read-write</access>
            <bitOffset>0x0</bitOffset>
            <bitWidth>0x8</bitWidth>
            <description>Start Bit "H" Width Setting</description>
            <name>RCSHW</name>
          </field>
        </fields>
        <name>RCSHW</name>
        <resetMask>0xFF</resetMask>
        <resetValue>0x0</resetValue>
        <size>0x8</size>
      </register>
    </registers>
    <registers>
      <register>
        <access>read-write</access>
        <addressOffset>0x49</addressOffset>
        <description>"H" Width Setting Register B</description>
        <fields>
          <field>
            <access>read-write</access>
            <bitOffset>0x0</bitOffset>
            <bitWidth>0x8</bitWidth>
            <description>"H" Width Setting B</description>
            <name>RCDBHW</name>
          </field>
        </fields>
        <name>RCDBHW</name>
        <resetMask>0xFF</resetMask>
        <resetValue>0x0</resetValue>
        <size>0x8</size>
      </register>
    </registers>
    <registers>
      <register>
        <access>read-write</access>
        <addressOffset>0x4C</addressOffset>
        <description>Device Address Setting Register 2</description>
        <fields>
          <field>
            <access>read-write</access>
            <bitOffset>0x0</bitOffset>
            <bitWidth>0x5</bitWidth>
            <description>Device Address 2</description>
            <name>RCADR2</name>
          </field>
        </fields>
        <name>RCADR2</name>
        <resetMask>0x1F</resetMask>
        <resetValue>0x0</resetValue>
        <size>0x8</size>
      </register>
    </registers>
    <registers>
      <register>
        <access>read-write</access>
        <addressOffset>0x4D</addressOffset>
        <description>Device Address Setting Register 1</description>
        <fields>
          <field>
            <access>read-write</access>
            <bitOffset>0x0</bitOffset>
            <bitWidth>0x5</bitWidth>
            <description>Device Address 1</description>
            <name>RCADR1</name>
          </field>
        </fields>
        <name>RCADR1</name>
        <resetMask>0x1F</resetMask>
        <resetValue>0x0</resetValue>
        <size>0x8</size>
      </register>
    </registers>
    <registers>
      <register>
        <access>read-only</access>
        <addressOffset>0x50</addressOffset>
        <description>Data Save Register (High-Low)</description>
        <fields>
          <field>
            <access>read-only</access>
            <bitOffset>0x0</bitOffset>
            <bitWidth>0x8</bitWidth>
            <description>RCDTHL</description>
            <name>RCDTHL</name>
          </field>
        </fields>
        <name>RCDTHL</name>
        <resetMask>0xFF</resetMask>
        <resetValue>0x0</resetValue>
        <size>0x8</size>
      </register>
    </registers>
    <registers>
      <register>
        <access>read-only</access>
        <addressOffset>0x51</addressOffset>
        <description>Data Save Register (High-High)</description>
        <fields>
          <field>
            <access>read-only</access>
            <bitOffset>0x0</bitOffset>
            <bitWidth>0x8</bitWidth>
            <description>RCDTHH</description>
            <name>RCDTHH</name>
          </field>
        </fields>
        <name>RCDTHH</name>
        <resetMask>0xFF</resetMask>
        <resetValue>0x0</resetValue>
        <size>0x8</size>
      </register>
    </registers>
    <registers>
      <register>
        <access>read-only</access>
        <addressOffset>0x54</addressOffset>
        <description>Data Save Register (Low-Low)</description>
        <fields>
          <field>
            <access>read-only</access>
            <bitOffset>0x0</bitOffset>
            <bitWidth>0x8</bitWidth>
            <description>RCDTLL</description>
            <name>RCDTLL</name>
          </field>
        </fields>
        <name>RCDTLL</name>
        <resetMask>0xFF</resetMask>
        <resetValue>0x0</resetValue>
        <size>0x8</size>
      </register>
    </registers>
    <registers>
      <register>
        <access>read-only</access>
        <addressOffset>0x55</addressOffset>
        <description>Data Save Register (Low-High)</description>
        <fields>
          <field>
            <access>read-only</access>
            <bitOffset>0x0</bitOffset>
            <bitWidth>0x8</bitWidth>
            <description>RCDTLH</description>
            <name>RCDTLH</name>
          </field>
        </fields>
        <name>RCDTLH</name>
        <resetMask>0xFF</resetMask>
        <resetValue>0x0</resetValue>
        <size>0x8</size>
      </register>
    </registers>
    <registers>
      <register>
        <access>read-write</access>
        <addressOffset>0x58</addressOffset>
        <description>Clock Division Setting Register</description>
        <fields>
          <field>
            <access>read-write</access>
            <bitOffset>0xC</bitOffset>
            <bitWidth>0x1</bitWidth>
            <description>Operating clock selection bit</description>
            <name>CKSEL</name>
          </field>
        </fields>
        <fields>
          <field>
            <access>read-write</access>
            <bitOffset>0x0</bitOffset>
            <bitWidth>0xC</bitWidth>
            <description>Operating clock division setting bits</description>
            <name>CKDIV</name>
          </field>
        </fields>
        <name>RCCKD</name>
        <resetMask>0x1FFF</resetMask>
        <resetValue>0x0</resetValue>
        <size>0x10</size>
      </register>
