ItaySharon/cmsis-svd/data/Fujitsu/MB9AFAAxN.svd
    </registers>
    <registers>
      <register>
        <access>read-only</access>
        <addressOffset>0x4</addressOffset>
        <description>Low-voltage Detection Interrupt Register</description>
        <fields>
          <field>
            <access>read-only</access>
            <bitOffset>0x7</bitOffset>
            <bitWidth>0x1</bitWidth>
            <description>Low-voltage detection interrupt bit</description>
            <name>LVDIR</name>
          </field>
        </fields>
        <name>LVD_STR</name>
        <resetMask>0x80</resetMask>
        <resetValue>0x0</resetValue>
        <size>0x8</size>
      </register>
    </registers>
    <registers>
      <register>
        <access>read-write</access>
        <addressOffset>0x8</addressOffset>
        <description>Low-voltage Detection Interrupt Clear Register</description>
        <fields>
          <field>
            <access>read-write</access>
            <bitOffset>0x7</bitOffset>
            <bitWidth>0x1</bitWidth>
            <description>Low-voltage detection interrupt clear bit</description>
            <name>LVDCL</name>
          </field>
        </fields>
        <name>LVD_CLR</name>
        <resetMask>0x80</resetMask>
        <resetValue>0x80</resetValue>
        <size>0x8</size>
      </register>
    </registers>
    <registers>
      <register>
        <access>read-write</access>
        <addressOffset>0xC</addressOffset>
        <description>Low-voltage Detection Voltage Protection Register</description>
        <fields>
          <field>
            <access>read-write</access>
            <bitOffset>0x0</bitOffset>
            <bitWidth>0x20</bitWidth>
            <description>Low-voltage Detection Voltage Control Register protection bits</description>
            <name>LVDLCK</name>
          </field>
        </fields>
        <name>LVD_RLR</name>
        <resetMask>0xFFFFFFFF</resetMask>
        <resetValue>0x1</resetValue>
        <size>0x20</size>
      </register>
    </registers>
    <registers>
      <register>
        <access>read-only</access>
        <addressOffset>0x10</addressOffset>
        <description>Low-voltage Detection Circuit Status Register</description>
        <fields>
          <field>
            <access>read-only</access>
            <bitOffset>0x7</bitOffset>
            <bitWidth>0x1</bitWidth>
            <description>Low-voltage detection interrupt status flag</description>
            <name>LVDIRDY</name>
          </field>
        </fields>
        <fields>
          <field>
            <access>read-only</access>
            <bitOffset>0x6</bitOffset>
            <bitWidth>0x1</bitWidth>
            <description>Low-voltage detection reset status flag</description>
            <name>LVDRRDY</name>
          </field>
        </fields>
        <name>LVD_STR2</name>
        <resetMask>0xC0</resetMask>
        <resetValue>0x40</resetValue>
        <size>0x8</size>
      </register>
    </registers>
    <resetMask>0x0</resetMask>
    <resetValue>0x0</resetValue>
    <size>0x20</size>
  </peripheral>
</peripherals>
<peripherals>
  <peripheral>
    <access>read-write</access>
    <addressBlock>
      <offset>0x4</offset>
      <size>0x1</size>
      <usage>registers</usage>
    </addressBlock>
    <baseAddress>0x40035100</baseAddress>
    <description>Low Power Consumption Mode</description>
    <groupName>DS</groupName>
    <interrupts></interrupts>
    <name>DS</name>
    <registers>
      <register>
        <access>read-write</access>
        <addressOffset>0x4</addressOffset>
        <description>Sub Clock Control Register</description>
        <fields>
          <field>
            <access>read-write</access>
            <bitOffset>0x1</bitOffset>
            <bitWidth>0x1</bitWidth>
            <description>CEC clock control bit </description>
            <name>CECCKE</name>
          </field>
        </fields>
        <fields>
          <field>
            <access>read-write</access>
            <bitOffset>0x0</bitOffset>
            <bitWidth>0x1</bitWidth>
            <description>RTC clock control bit</description>
            <name>RTCCKE</name>
          </field>
        </fields>
        <name>RCK_CTL</name>
        <resetMask>0x3</resetMask>
        <resetValue>0x1</resetValue>
        <size>0x8</size>
      </register>
    </registers>
    <registers>
      <register>
        <access>read-write</access>
        <addressOffset>0x700</addressOffset>
        <description>RTC Mode Control Register</description>
        <fields>
          <field>
            <access>read-write</access>
            <bitOffset>0x0</bitOffset>
            <bitWidth>0x1</bitWidth>
            <description>RTC mode control bit</description>
            <name>RTCE</name>
          </field>
        </fields>
        <name>PMD_CTL</name>
        <resetMask>0x1</resetMask>
        <resetValue>0x0</resetValue>
        <size>0x8</size>
      </register>
    </registers>
    <registers>
      <register>
        <access>read-write</access>
        <addressOffset>0x704</addressOffset>
        <description>Deep Standby Return Cause Register 1</description>
        <fields>
          <field>
            <access>read-write</access>
            <bitOffset>0x1</bitOffset>
            <bitWidth>0x1</bitWidth>
            <description>Low-voltage detection reset return bit</description>
            <name>WLVDH</name>
          </field>
        </fields>
        <fields>
          <field>
            <access>read-write</access>
            <bitOffset>0x0</bitOffset>
            <bitWidth>0x1</bitWidth>
            <description>INITX pin input reset return bit </description>
            <name>WINITX</name>
          </field>
        </fields>
        <name>WRFSR</name>
        <resetMask>0x3</resetMask>
        <resetValue>0x0</resetValue>
        <size>0x8</size>
      </register>
    </registers>
    <registers>
      <register>
        <access>read-only</access>
        <addressOffset>0x708</addressOffset>
        <description>Deep Standby Return Cause Register 2</description>
        <fields>
          <field>
            <access>read-only</access>
            <bitOffset>0x9</bitOffset>
            <bitWidth>0x1</bitWidth>
            <description>CEC ch.1 interrupt return bit</description>
            <name>WCEC1I</name>
          </field>
        </fields>
        <fields>
          <field>
            <access>read-only</access>
            <bitOffset>0x8</bitOffset>
            <bitWidth>0x1</bitWidth>
            <description>CEC ch.0 interrupt return bit</description>
            <name>WCEC0I</name>
          </field>
        </fields>
        <fields>
          <field>
            <access>read-only</access>
            <bitOffset>0x5</bitOffset>
            <bitWidth>0x1</bitWidth>
            <description>WKUP pin input return bit 3</description>
            <name>WUI3</name>
          </field>
        </fields>
        <fields>
          <field>
            <access>read-only</access>
            <bitOffset>0x4</bitOffset>
            <bitWidth>0x1</bitWidth>
            <description>WKUP pin input return bit 2</description>
            <name>WUI2</name>
          </field>
        </fields>
        <fields>
          <field>
            <access>read-only</access>
            <bitOffset>0x3</bitOffset>
            <bitWidth>0x1</bitWidth>
            <description>WKUP pin input return bit 1</description>
            <name>WUI1</name>
          </field>
        </fields>
        <fields>
          <field>
            <access>read-only</access>
            <bitOffset>0x2</bitOffset>
            <bitWidth>0x1</bitWidth>
            <description>WKUP pin input return bit 0</description>
            <name>WUI0</name>
          </field>
        </fields>
        <fields>
          <field>
            <access>read-only</access>
            <bitOffset>0x1</bitOffset>
            <bitWidth>0x1</bitWidth>
            <description>LVD interrupt return bit</description>
            <name>WLVDI</name>
          </field>
        </fields>
        <fields>
          <field>
            <access>read-only</access>
            <bitOffset>0x0</bitOffset>
            <bitWidth>0x1</bitWidth>
            <description>RTC interrupt return bit</description>
            <name>WRTCI</name>
          </field>
        </fields>
        <name>WIFSR</name>
        <resetMask>0x33F</resetMask>
        <resetValue>0x0</resetValue>
        <size>0x10</size>
      </register>
