ItaySharon/cmsis-svd/data/Fujitsu/MB9AFAAxN.svd
    </registers>
    <registers>
      <register>
        <access>read-write</access>
        <addressOffset>0x70C</addressOffset>
        <description>Deep Standby Return Enable Register</description>
        <fields>
          <field>
            <access>read-write</access>
            <bitOffset>0x9</bitOffset>
            <bitWidth>0x1</bitWidth>
            <description>HDMI-CEC/ Remote Control Reception ch.1 interrupt return enable bit</description>
            <name>WCEC1E</name>
          </field>
        </fields>
        <fields>
          <field>
            <access>read-write</access>
            <bitOffset>0x8</bitOffset>
            <bitWidth>0x1</bitWidth>
            <description>HDMI-CEC/ Remote Control Reception ch.0 interrupt return enable bit</description>
            <name>WCEC0E</name>
          </field>
        </fields>
        <fields>
          <field>
            <access>read-write</access>
            <bitOffset>0x5</bitOffset>
            <bitWidth>0x1</bitWidth>
            <description>WKUP pin input return enable bit 3</description>
            <name>WUI3E</name>
          </field>
        </fields>
        <fields>
          <field>
            <access>read-write</access>
            <bitOffset>0x4</bitOffset>
            <bitWidth>0x1</bitWidth>
            <description>WKUP pin input return enable bit 2</description>
            <name>WUI2E</name>
          </field>
        </fields>
        <fields>
          <field>
            <access>read-write</access>
            <bitOffset>0x3</bitOffset>
            <bitWidth>0x1</bitWidth>
            <description>WKUP pin input return enable bit 1</description>
            <name>WUI1E</name>
          </field>
        </fields>
        <fields>
          <field>
            <access>read-write</access>
            <bitOffset>0x1</bitOffset>
            <bitWidth>0x1</bitWidth>
            <description>LVD interrupt return enable bit</description>
            <name>WLVDE</name>
          </field>
        </fields>
        <fields>
          <field>
            <access>read-write</access>
            <bitOffset>0x0</bitOffset>
            <bitWidth>0x1</bitWidth>
            <description>RTC interrupt return enable bit</description>
            <name>WRTCE</name>
          </field>
        </fields>
        <name>WIER</name>
        <resetMask>0x33B</resetMask>
        <resetValue>0x0</resetValue>
        <size>0x10</size>
      </register>
    </registers>
    <registers>
      <register>
        <access>read-write</access>
        <addressOffset>0x710</addressOffset>
        <description>WKUP Pin Input Level Register</description>
        <fields>
          <field>
            <access>read-write</access>
            <bitOffset>0x2</bitOffset>
            <bitWidth>0x1</bitWidth>
            <description>WKUP pin input level select bit 3</description>
            <name>WUI3LV</name>
          </field>
        </fields>
        <fields>
          <field>
            <access>read-write</access>
            <bitOffset>0x1</bitOffset>
            <bitWidth>0x1</bitWidth>
            <description>WKUP pin input level select bit 2</description>
            <name>WUI2LV</name>
          </field>
        </fields>
        <fields>
          <field>
            <access>read-write</access>
            <bitOffset>0x0</bitOffset>
            <bitWidth>0x1</bitWidth>
            <description>WKUP pin input level select bit 1</description>
            <name>WUI1LV</name>
          </field>
        </fields>
        <name>WILVR</name>
        <resetMask>0x7</resetMask>
        <resetValue>0x0</resetValue>
        <size>0x8</size>
      </register>
    </registers>
    <registers>
      <register>
        <access>read-write</access>
        <addressOffset>0x800</addressOffset>
        <description>Backup Registers from 1</description>
        <fields></fields>
        <name>BUR01</name>
        <resetMask>0xFF</resetMask>
        <resetValue>0x0</resetValue>
        <size>0x8</size>
      </register>
    </registers>
    <registers>
      <register>
        <access>read-write</access>
        <addressOffset>0x801</addressOffset>
        <description>Backup Registers from 2</description>
        <fields></fields>
        <name>BUR02</name>
        <resetMask>0xFF</resetMask>
        <resetValue>0x0</resetValue>
        <size>0x8</size>
      </register>
    </registers>
    <registers>
      <register>
        <access>read-write</access>
        <addressOffset>0x802</addressOffset>
        <description>Backup Registers from 3</description>
        <fields></fields>
        <name>BUR03</name>
        <resetMask>0xFF</resetMask>
        <resetValue>0x0</resetValue>
        <size>0x8</size>
      </register>
    </registers>
    <registers>
      <register>
        <access>read-write</access>
        <addressOffset>0x803</addressOffset>
        <description>Backup Registers from 4</description>
        <fields></fields>
        <name>BUR04</name>
        <resetMask>0xFF</resetMask>
        <resetValue>0x0</resetValue>
        <size>0x8</size>
      </register>
    </registers>
    <registers>
      <register>
        <access>read-write</access>
        <addressOffset>0x804</addressOffset>
        <description>Backup Registers from 5</description>
        <fields></fields>
        <name>BUR05</name>
        <resetMask>0xFF</resetMask>
        <resetValue>0x0</resetValue>
        <size>0x8</size>
      </register>
    </registers>
    <registers>
      <register>
        <access>read-write</access>
        <addressOffset>0x805</addressOffset>
        <description>Backup Registers from 6</description>
        <fields></fields>
        <name>BUR06</name>
        <resetMask>0xFF</resetMask>
        <resetValue>0x0</resetValue>
        <size>0x8</size>
      </register>
    </registers>
    <registers>
      <register>
        <access>read-write</access>
        <addressOffset>0x806</addressOffset>
        <description>Backup Registers from 7</description>
        <fields></fields>
        <name>BUR07</name>
        <resetMask>0xFF</resetMask>
        <resetValue>0x0</resetValue>
        <size>0x8</size>
      </register>
