ItaySharon/cmsis-svd/data/Fujitsu/MB9AFAAxN.svd
    </registers>
    <registers>
      <register>
        <access>read-write</access>
        <addressOffset>0x5</addressOffset>
        <alternateGroup>CSIO</alternateGroup>
        <description>Serial Status Register</description>
        <fields>
          <field>
            <access>read-write</access>
            <bitOffset>0x7</bitOffset>
            <bitWidth>0x1</bitWidth>
            <description>Received error flag clear bit </description>
            <name>REC</name>
          </field>
        </fields>
        <fields>
          <field>
            <access>read-only</access>
            <bitOffset>0x3</bitOffset>
            <bitWidth>0x1</bitWidth>
            <description>Overrun error flag bit </description>
            <name>ORE</name>
          </field>
        </fields>
        <fields>
          <field>
            <access>read-only</access>
            <bitOffset>0x2</bitOffset>
            <bitWidth>0x1</bitWidth>
            <description>Received data full flag bit </description>
            <name>RDRF</name>
          </field>
        </fields>
        <fields>
          <field>
            <access>read-only</access>
            <bitOffset>0x1</bitOffset>
            <bitWidth>0x1</bitWidth>
            <description>Transmit data empty flag bit </description>
            <name>TDRE</name>
          </field>
        </fields>
        <fields>
          <field>
            <access>read-only</access>
            <bitOffset>0x0</bitOffset>
            <bitWidth>0x1</bitWidth>
            <description>Transmit bus idle flag bit</description>
            <name>TBI</name>
          </field>
        </fields>
        <name>CSIO_SSR</name>
        <resetMask>0x8F</resetMask>
        <resetValue>0x3</resetValue>
        <size>0x8</size>
      </register>
    </registers>
    <registers>
      <register>
        <access>read-write</access>
        <addressOffset>0x4</addressOffset>
        <alternateGroup>CSIO</alternateGroup>
        <description>Extended Communication Control Register</description>
        <fields>
          <field>
            <access>read-write</access>
            <bitOffset>0x7</bitOffset>
            <bitWidth>0x1</bitWidth>
            <description>Serial output pin set bit </description>
            <name>SOP</name>
          </field>
        </fields>
        <fields>
          <field>
            <access>read-write</access>
            <bitOffset>0x3</bitOffset>
            <bitWidth>0x2</bitWidth>
            <description>Data transmit/received wait select bits</description>
            <name>WT</name>
          </field>
        </fields>
        <fields>
          <field>
            <access>read-write</access>
            <bitOffset>0x0</bitOffset>
            <bitWidth>0x3</bitWidth>
            <description>Data length select bits</description>
            <name>L</name>
          </field>
        </fields>
        <name>CSIO_ESCR</name>
        <resetMask>0x9F</resetMask>
        <resetValue>0x0</resetValue>
        <size>0x8</size>
      </register>
    </registers>
    <registers>
      <register>
        <access>read-only</access>
        <addressOffset>0x8</addressOffset>
        <alternateGroup>CSIO</alternateGroup>
        <description>Received Data Register</description>
        <fields></fields>
        <name>CSIO_RDR</name>
        <resetMask>0x1FF</resetMask>
        <resetValue>0x0</resetValue>
        <size>0x10</size>
      </register>
    </registers>
    <registers>
      <register>
        <access>write-only</access>
        <addressOffset>0x8</addressOffset>
        <alternateGroup>CSIO</alternateGroup>
        <description>Transmit Data Register</description>
        <fields></fields>
        <name>CSIO_TDR</name>
        <resetMask>0x1FF</resetMask>
        <resetValue>0x1FF</resetValue>
        <size>0x10</size>
      </register>
    </registers>
    <registers>
      <register>
        <access>read-write</access>
        <addressOffset>0xC</addressOffset>
        <alternateGroup>CSIO</alternateGroup>
        <description>Baud Rate Generator Registers</description>
        <fields>
          <field>
            <access>read-write</access>
            <bitOffset>0x8</bitOffset>
            <bitWidth>0x7</bitWidth>
            <description>Baud Rate Generator Registers 1</description>
            <name>BGR1</name>
          </field>
        </fields>
        <fields>
          <field>
            <access>read-write</access>
            <bitOffset>0x0</bitOffset>
            <bitWidth>0x8</bitWidth>
            <description>Baud Rate Generator Registers 0</description>
            <name>BGR0</name>
          </field>
        </fields>
        <name>CSIO_BGR</name>
        <resetMask>0x7FFF</resetMask>
        <resetValue>0x0</resetValue>
        <size>0x10</size>
      </register>
    </registers>
    <registers>
      <register>
        <access>read-write</access>
        <addressOffset>0x1</addressOffset>
        <alternateGroup>I2C</alternateGroup>
        <description>I2C Bus Control Register</description>
        <fields>
          <field>
            <access>read-write</access>
            <bitOffset>0x7</bitOffset>
            <bitWidth>0x1</bitWidth>
            <description>Master/slave select bit </description>
            <name>MSS</name>
          </field>
        </fields>
        <fields>
          <field>
            <access>read-write</access>
            <bitOffset>0x6</bitOffset>
            <bitWidth>0x1</bitWidth>
            <description>Operation flag/iteration start condition generation bit</description>
            <name>ACT_SCC</name>
          </field>
        </fields>
        <fields>
          <field>
            <access>read-write</access>
            <bitOffset>0x5</bitOffset>
            <bitWidth>0x1</bitWidth>
            <description>Data byte acknowledge enable bit </description>
            <name>ACKE</name>
          </field>
        </fields>
        <fields>
          <field>
            <access>read-write</access>
            <bitOffset>0x4</bitOffset>
            <bitWidth>0x1</bitWidth>
            <description>Wait selection bit </description>
            <name>WSEL</name>
          </field>
        </fields>
        <fields>
          <field>
            <access>read-write</access>
            <bitOffset>0x3</bitOffset>
            <bitWidth>0x1</bitWidth>
            <description>Condition detection interrupt enable bit </description>
            <name>CNDE</name>
          </field>
        </fields>
        <fields>
          <field>
            <access>read-write</access>
            <bitOffset>0x2</bitOffset>
            <bitWidth>0x1</bitWidth>
            <description>Interrupt enable bit </description>
            <name>INTE</name>
          </field>
        </fields>
        <fields>
          <field>
            <access>read-only</access>
            <bitOffset>0x1</bitOffset>
            <bitWidth>0x1</bitWidth>
            <description>Bus error flag bit </description>
            <name>BER</name>
          </field>
        </fields>
        <fields>
          <field>
            <access>read-write</access>
            <bitOffset>0x0</bitOffset>
            <bitWidth>0x1</bitWidth>
            <description>interrupt flag bit </description>
            <name>INT</name>
          </field>
        </fields>
        <name>I2C_IBCR</name>
        <resetMask>0xFF</resetMask>
        <resetValue>0x0</resetValue>
        <size>0x8</size>
      </register>
