ItaySharon/cmsis-svd/data/Fujitsu/MB9AFAAxN.svd
    </registers>
    <registers>
      <register>
        <access>read-write</access>
        <addressOffset>0x20</addressOffset>
        <description>Clock Selection Register</description>
        <fields>
          <field>
            <access>read-write</access>
            <bitOffset>0x0</bitOffset>
            <bitWidth>0x1</bitWidth>
            <description>Input clock selection bit </description>
            <name>WTCLKS</name>
          </field>
        </fields>
        <name>WTCLKS</name>
        <resetMask>0x1</resetMask>
        <resetValue>0x0</resetValue>
        <size>0x8</size>
      </register>
    </registers>
    <registers>
      <register>
        <access>read-only</access>
        <addressOffset>0x21</addressOffset>
        <description>Selection Clock Status Register</description>
        <fields>
          <field>
            <access>read-only</access>
            <bitOffset>0x0</bitOffset>
            <bitWidth>0x2</bitWidth>
            <description>Clock selection status bit </description>
            <name>WTCLKM</name>
          </field>
        </fields>
        <name>WTCLKM</name>
        <resetMask>0x3</resetMask>
        <resetValue>0x0</resetValue>
        <size>0x8</size>
      </register>
    </registers>
    <registers>
      <register>
        <access>read-write</access>
        <addressOffset>0x24</addressOffset>
        <description>Frequency Correction Value Setting Register</description>
        <fields>
          <field>
            <access>read-write</access>
            <bitOffset>0x0</bitOffset>
            <bitWidth>0xA</bitWidth>
            <description>Frequency correction value</description>
            <name>WTCAL</name>
          </field>
        </fields>
        <name>WTCAL</name>
        <resetMask>0x3FF</resetMask>
        <resetValue>0x0</resetValue>
        <size>0x10</size>
      </register>
    </registers>
    <registers>
      <register>
        <access>read-write</access>
        <addressOffset>0x26</addressOffset>
        <description>Frequency Correction Enable Register</description>
        <fields>
          <field>
            <access>read-write</access>
            <bitOffset>0x0</bitOffset>
            <bitWidth>0x1</bitWidth>
            <description>Frequency correction enable bit </description>
            <name>WTCALEN</name>
          </field>
        </fields>
        <name>WTCALEN</name>
        <resetMask>0x1</resetMask>
        <resetValue>0x0</resetValue>
        <size>0x8</size>
      </register>
    </registers>
    <registers>
      <register>
        <access>read-write</access>
        <addressOffset>0x28</addressOffset>
        <description>Divider Ratio Setting Register</description>
        <fields>
          <field>
            <access>read-write</access>
            <bitOffset>0x0</bitOffset>
            <bitWidth>0x4</bitWidth>
            <description>Divider ratio</description>
            <name>WTDIV</name>
          </field>
        </fields>
        <name>WTDIV</name>
        <resetMask>0xF</resetMask>
        <resetValue>0x0</resetValue>
        <size>0x8</size>
      </register>
    </registers>
    <registers>
      <register>
        <access>read-write</access>
        <addressOffset>0x29</addressOffset>
        <description>Divider Output Enable Register</description>
        <fields>
          <field>
            <access>read-only</access>
            <bitOffset>0x1</bitOffset>
            <bitWidth>0x1</bitWidth>
            <description>Divider status bit </description>
            <name>WTDIVRDY</name>
          </field>
        </fields>
        <fields>
          <field>
            <access>read-write</access>
            <bitOffset>0x0</bitOffset>
            <bitWidth>0x1</bitWidth>
            <description>Divider enable bit </description>
            <name>WTDIVEN</name>
          </field>
        </fields>
        <name>WTDIVEN</name>
        <resetMask>0x3</resetMask>
        <resetValue>0x0</resetValue>
        <size>0x8</size>
      </register>
    </registers>
    <registers>
      <register>
        <access>read-write</access>
        <addressOffset>0x2C</addressOffset>
        <description>Frequency Correction Cycle Setting Register</description>
        <fields>
          <field>
            <access>read-write</access>
            <bitOffset>0x0</bitOffset>
            <bitWidth>0x6</bitWidth>
            <description>frequency correction value</description>
            <name>WTCALPRD</name>
          </field>
        </fields>
        <name>WTCALPRD</name>
        <resetMask>0x3F</resetMask>
        <resetValue>0x13</resetValue>
        <size>0x8</size>
      </register>
    </registers>
    <registers>
      <register>
        <access>read-write</access>
        <addressOffset>0x30</addressOffset>
        <description>RTCCO Output Selection Register</description>
        <fields>
          <field>
            <access>read-write</access>
            <bitOffset>0x0</bitOffset>
            <bitWidth>0x1</bitWidth>
            <description>RTCCO output selection bit</description>
            <name>WTCOSEL</name>
          </field>
        </fields>
        <name>WTCOSEL</name>
        <resetMask>0x1</resetMask>
        <resetValue>0x0</resetValue>
        <size>0x8</size>
      </register>
    </registers>
    <resetMask>0x0</resetMask>
    <resetValue>0x0</resetValue>
    <size>0x20</size>
  </peripheral>
</peripherals>
<resetMask>0x0</resetMask>
<resetValue>0x0</resetValue>
<size>0x20</size>
<version>1.1</version>
<width>0x20</width></device>